GopalSaraf/Practicals/PSDL/include/proc/pic16lf1716.inc
// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 061Ch
// bitfield definitions
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h

// Register: COG1PHR
#define COG1PHR COG1PHR
COG1PHR                                  equ 0691h
// bitfield definitions
COG1PHR_G1PHR_POSN                       equ 0000h
COG1PHR_G1PHR_POSITION                   equ 0000h
COG1PHR_G1PHR_SIZE                       equ 0006h
COG1PHR_G1PHR_LENGTH                     equ 0006h
COG1PHR_G1PHR_MASK                       equ 003Fh
COG1PHR_G1PHR0_POSN                      equ 0000h
COG1PHR_G1PHR0_POSITION                  equ 0000h
COG1PHR_G1PHR0_SIZE                      equ 0001h
COG1PHR_G1PHR0_LENGTH                    equ 0001h
COG1PHR_G1PHR0_MASK                      equ 0001h
COG1PHR_G1PHR1_POSN                      equ 0001h
COG1PHR_G1PHR1_POSITION                  equ 0001h
COG1PHR_G1PHR1_SIZE                      equ 0001h
COG1PHR_G1PHR1_LENGTH                    equ 0001h
COG1PHR_G1PHR1_MASK                      equ 0002h
COG1PHR_G1PHR2_POSN                      equ 0002h
COG1PHR_G1PHR2_POSITION                  equ 0002h
COG1PHR_G1PHR2_SIZE                      equ 0001h
COG1PHR_G1PHR2_LENGTH                    equ 0001h
COG1PHR_G1PHR2_MASK                      equ 0004h
COG1PHR_G1PHR3_POSN                      equ 0003h
COG1PHR_G1PHR3_POSITION                  equ 0003h
COG1PHR_G1PHR3_SIZE                      equ 0001h
COG1PHR_G1PHR3_LENGTH                    equ 0001h
COG1PHR_G1PHR3_MASK                      equ 0008h
COG1PHR_G1PHR4_POSN                      equ 0004h
COG1PHR_G1PHR4_POSITION                  equ 0004h
COG1PHR_G1PHR4_SIZE                      equ 0001h
COG1PHR_G1PHR4_LENGTH                    equ 0001h
COG1PHR_G1PHR4_MASK                      equ 0010h
COG1PHR_G1PHR5_POSN                      equ 0005h
COG1PHR_G1PHR5_POSITION                  equ 0005h
COG1PHR_G1PHR5_SIZE                      equ 0001h
COG1PHR_G1PHR5_LENGTH                    equ 0001h
COG1PHR_G1PHR5_MASK                      equ 0020h

// Register: COG1PHF
#define COG1PHF COG1PHF
COG1PHF                                  equ 0692h
// bitfield definitions
COG1PHF_G1PHF_POSN                       equ 0000h
COG1PHF_G1PHF_POSITION                   equ 0000h
COG1PHF_G1PHF_SIZE                       equ 0006h
COG1PHF_G1PHF_LENGTH                     equ 0006h
COG1PHF_G1PHF_MASK                       equ 003Fh
COG1PHF_G1PHF0_POSN                      equ 0000h
COG1PHF_G1PHF0_POSITION                  equ 0000h
COG1PHF_G1PHF0_SIZE                      equ 0001h
COG1PHF_G1PHF0_LENGTH                    equ 0001h
COG1PHF_G1PHF0_MASK                      equ 0001h
COG1PHF_G1PHF1_POSN                      equ 0001h
COG1PHF_G1PHF1_POSITION                  equ 0001h
COG1PHF_G1PHF1_SIZE                      equ 0001h
COG1PHF_G1PHF1_LENGTH                    equ 0001h
COG1PHF_G1PHF1_MASK                      equ 0002h
COG1PHF_G1PHF2_POSN                      equ 0002h
COG1PHF_G1PHF2_POSITION                  equ 0002h
COG1PHF_G1PHF2_SIZE                      equ 0001h
COG1PHF_G1PHF2_LENGTH                    equ 0001h
COG1PHF_G1PHF2_MASK                      equ 0004h
COG1PHF_G1PHF3_POSN                      equ 0003h
COG1PHF_G1PHF3_POSITION                  equ 0003h
COG1PHF_G1PHF3_SIZE                      equ 0001h
COG1PHF_G1PHF3_LENGTH                    equ 0001h
COG1PHF_G1PHF3_MASK                      equ 0008h
COG1PHF_G1PHF4_POSN                      equ 0004h
COG1PHF_G1PHF4_POSITION                  equ 0004h
COG1PHF_G1PHF4_SIZE                      equ 0001h
COG1PHF_G1PHF4_LENGTH                    equ 0001h
COG1PHF_G1PHF4_MASK                      equ 0010h
COG1PHF_G1PHF5_POSN                      equ 0005h
COG1PHF_G1PHF5_POSITION                  equ 0005h
COG1PHF_G1PHF5_SIZE                      equ 0001h
COG1PHF_G1PHF5_LENGTH                    equ 0001h
COG1PHF_G1PHF5_MASK                      equ 0020h

// Register: COG1BLKR
#define COG1BLKR COG1BLKR
COG1BLKR                                 equ 0693h
// bitfield definitions
COG1BLKR_G1BLKR_POSN                     equ 0000h
COG1BLKR_G1BLKR_POSITION                 equ 0000h
COG1BLKR_G1BLKR_SIZE                     equ 0006h
COG1BLKR_G1BLKR_LENGTH                   equ 0006h
COG1BLKR_G1BLKR_MASK                     equ 003Fh
COG1BLKR_G1BLKR0_POSN                    equ 0000h
COG1BLKR_G1BLKR0_POSITION                equ 0000h
COG1BLKR_G1BLKR0_SIZE                    equ 0001h
COG1BLKR_G1BLKR0_LENGTH                  equ 0001h
COG1BLKR_G1BLKR0_MASK                    equ 0001h
COG1BLKR_G1BLKR1_POSN                    equ 0001h
COG1BLKR_G1BLKR1_POSITION                equ 0001h
COG1BLKR_G1BLKR1_SIZE                    equ 0001h
COG1BLKR_G1BLKR1_LENGTH                  equ 0001h
COG1BLKR_G1BLKR1_MASK                    equ 0002h
COG1BLKR_G1BLKR2_POSN                    equ 0002h
COG1BLKR_G1BLKR2_POSITION                equ 0002h
COG1BLKR_G1BLKR2_SIZE                    equ 0001h
COG1BLKR_G1BLKR2_LENGTH                  equ 0001h
COG1BLKR_G1BLKR2_MASK                    equ 0004h
COG1BLKR_G1BLKR3_POSN                    equ 0003h
COG1BLKR_G1BLKR3_POSITION                equ 0003h
COG1BLKR_G1BLKR3_SIZE                    equ 0001h
COG1BLKR_G1BLKR3_LENGTH                  equ 0001h
COG1BLKR_G1BLKR3_MASK                    equ 0008h
COG1BLKR_G1BLKR4_POSN                    equ 0004h
COG1BLKR_G1BLKR4_POSITION                equ 0004h
COG1BLKR_G1BLKR4_SIZE                    equ 0001h
COG1BLKR_G1BLKR4_LENGTH                  equ 0001h
COG1BLKR_G1BLKR4_MASK                    equ 0010h
COG1BLKR_G1BLKR5_POSN                    equ 0005h
COG1BLKR_G1BLKR5_POSITION                equ 0005h
COG1BLKR_G1BLKR5_SIZE                    equ 0001h
COG1BLKR_G1BLKR5_LENGTH                  equ 0001h
COG1BLKR_G1BLKR5_MASK                    equ 0020h

// Register: COG1BLKF
#define COG1BLKF COG1BLKF
COG1BLKF                                 equ 0694h
// bitfield definitions
COG1BLKF_G1BLKF_POSN                     equ 0000h
COG1BLKF_G1BLKF_POSITION                 equ 0000h
COG1BLKF_G1BLKF_SIZE                     equ 0006h
COG1BLKF_G1BLKF_LENGTH                   equ 0006h
COG1BLKF_G1BLKF_MASK                     equ 003Fh
COG1BLKF_G1BLKF0_POSN                    equ 0000h
COG1BLKF_G1BLKF0_POSITION                equ 0000h
COG1BLKF_G1BLKF0_SIZE                    equ 0001h
COG1BLKF_G1BLKF0_LENGTH                  equ 0001h
COG1BLKF_G1BLKF0_MASK                    equ 0001h
COG1BLKF_G1BLKF1_POSN                    equ 0001h
COG1BLKF_G1BLKF1_POSITION                equ 0001h
COG1BLKF_G1BLKF1_SIZE                    equ 0001h
COG1BLKF_G1BLKF1_LENGTH                  equ 0001h
COG1BLKF_G1BLKF1_MASK                    equ 0002h
COG1BLKF_G1BLKF2_POSN                    equ 0002h
COG1BLKF_G1BLKF2_POSITION                equ 0002h
COG1BLKF_G1BLKF2_SIZE                    equ 0001h
COG1BLKF_G1BLKF2_LENGTH                  equ 0001h
COG1BLKF_G1BLKF2_MASK                    equ 0004h
COG1BLKF_G1BLKF3_POSN                    equ 0003h
COG1BLKF_G1BLKF3_POSITION                equ 0003h
COG1BLKF_G1BLKF3_SIZE                    equ 0001h
COG1BLKF_G1BLKF3_LENGTH                  equ 0001h
COG1BLKF_G1BLKF3_MASK                    equ 0008h
COG1BLKF_G1BLKF4_POSN                    equ 0004h
COG1BLKF_G1BLKF4_POSITION                equ 0004h
COG1BLKF_G1BLKF4_SIZE                    equ 0001h
COG1BLKF_G1BLKF4_LENGTH                  equ 0001h
COG1BLKF_G1BLKF4_MASK                    equ 0010h
COG1BLKF_G1BLKF5_POSN                    equ 0005h
COG1BLKF_G1BLKF5_POSITION                equ 0005h
COG1BLKF_G1BLKF5_SIZE                    equ 0001h
COG1BLKF_G1BLKF5_LENGTH                  equ 0001h
COG1BLKF_G1BLKF5_MASK                    equ 0020h

// Register: COG1DBR
#define COG1DBR COG1DBR
COG1DBR                                  equ 0695h
// bitfield definitions
COG1DBR_G1DBR_POSN                       equ 0000h
COG1DBR_G1DBR_POSITION                   equ 0000h
COG1DBR_G1DBR_SIZE                       equ 0006h
COG1DBR_G1DBR_LENGTH                     equ 0006h
COG1DBR_G1DBR_MASK                       equ 003Fh
COG1DBR_G1DBR0_POSN                      equ 0000h
COG1DBR_G1DBR0_POSITION                  equ 0000h
COG1DBR_G1DBR0_SIZE                      equ 0001h
COG1DBR_G1DBR0_LENGTH                    equ 0001h
COG1DBR_G1DBR0_MASK                      equ 0001h
COG1DBR_G1DBR1_POSN                      equ 0001h
COG1DBR_G1DBR1_POSITION                  equ 0001h
COG1DBR_G1DBR1_SIZE                      equ 0001h
COG1DBR_G1DBR1_LENGTH                    equ 0001h
COG1DBR_G1DBR1_MASK                      equ 0002h
COG1DBR_G1DBR2_POSN                      equ 0002h
COG1DBR_G1DBR2_POSITION                  equ 0002h
COG1DBR_G1DBR2_SIZE                      equ 0001h
COG1DBR_G1DBR2_LENGTH                    equ 0001h
COG1DBR_G1DBR2_MASK                      equ 0004h
COG1DBR_G1DBR3_POSN                      equ 0003h
COG1DBR_G1DBR3_POSITION                  equ 0003h
COG1DBR_G1DBR3_SIZE                      equ 0001h
COG1DBR_G1DBR3_LENGTH                    equ 0001h
COG1DBR_G1DBR3_MASK                      equ 0008h
COG1DBR_G1DBR4_POSN                      equ 0004h
COG1DBR_G1DBR4_POSITION                  equ 0004h
COG1DBR_G1DBR4_SIZE                      equ 0001h
COG1DBR_G1DBR4_LENGTH                    equ 0001h
COG1DBR_G1DBR4_MASK                      equ 0010h
COG1DBR_G1DBR5_POSN                      equ 0005h
COG1DBR_G1DBR5_POSITION                  equ 0005h
COG1DBR_G1DBR5_SIZE                      equ 0001h
COG1DBR_G1DBR5_LENGTH                    equ 0001h
COG1DBR_G1DBR5_MASK                      equ 0020h

